workspace/Catalogs/АукНастройкиРасчетовИтогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукНастройкиРасчетовИтогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.АукВидыАукционов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРезультата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукВидыРезультатовРасчетаИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Переменная</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактируется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаВыбораЗначенийПеременных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Переменная</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.АукИсточникиЗначенийПеременных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеременнаяНомерСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаСписанияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписыватьПоПеременной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МожноСписыватьЧастично</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Enums/АукИсточникиЗначенийПеременных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукИсточникиЗначенийПеременных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараметрАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредопределенныеДанные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Catalogs/АукНастройкиРасчетовИтогов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Справочник_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.ДополнительныеПараметры.Свойство("ОткрытиеИзФормыВладельца") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Эта форма может быть открыта только с формы Вид аукциона!'"),,,, Отказ);
		
		Возврат;	
	КонецЕсли;
		
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Справочник_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Справочник_ПриОткрытии(ЭтотОбъект, Отказ);	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	НастроитьИнтерфейс();
	
	ПодпискиНаСобытияФормКлиент.Справочник_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	ЗаполнитьШаблонРезультатаИзДанныхФормы();
	
	Если ПроверитьЗаполнениеКастомное(Отказ) Тогда
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("Формула",			Объект.Формула);
		сткПараметры.Вставить("Переменные", 		ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(Объект.Переменные, "Переменная"));
		сткПараметры.Вставить("ЗначенияПеременных", ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(
																	Объект.НастройкаВыбораЗначенийПеременных, "Переменная"));
		
		сткРез = АукОбщийВызовСервера.ПроверитьФормулуРасчетаИСписокПеременных(сткПараметры);
		
		Если Не сткРез.Успех Тогда
			Отказ = Истина;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(сткРез.Результат);
			
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Формула = АукОбщийСервер.НормализоватьСтрокуФормулы(ТекущийОбъект.Формула);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПеременныеПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда	
		УстановитьОтборЗначенийПеременной(ТекДанные.НомерСтроки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыбораЗначенийПеременныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	Отказ = Истина;
	
	Если Не Копирование Тогда	
		ДобавитьЗначениеПеременнойПоПеременной();
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыбораЗначенийПеременныхПриАктивизацииСтроки(Элемент)	
	УстановитьОтобрыНаПолеВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыбораЗначенийПеременныхПриАктивизацииПоля(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "НастройкаВыбораЗначенийПеременныхЗначениеДанных" Тогда
		УстановитьОтобрыНаПолеВыбора(Элемент);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПеременныеПередУдалением(Элемент, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		АукОбщийКлиентСервер.УдалитьСтрокиТаблицыПоСтруктуреОтборов(Объект.НастройкаВыбораЗначенийПеременных, Новый Структура("Переменная", ТекДанные.Переменная));	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСписанияПараметровПриАктивизацииПоля(Элемент)
	Если Элемент.ТекущийЭлемент.Имя = "НастройкаСписанияПараметровСписыватьПоПеременной" Тогда 
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		
		Элемент.ТекущийЭлемент.СписокВыбора.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(Объект.Переменные, "Переменная", Истина));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонРезультатаТекстДоПриИзменении(Элемент)
	Модифицированность = Истина;
	
	ОбновитьПримерШаблонаРезультата();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонРезультатаТекстПослеПриИзменении(Элемент)
	Модифицированность = Истина;
	
	ОбновитьПримерШаблонаРезультата();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыбораЗначенийПеременныхЗначениеДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.НастройкаВыбораЗначенийПеременных.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ВыборНастройкиРасчетовИтогов_ОбработкаВыбора(ВыбранноеЗначение, ТекДанные);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыбораЗначенийПеременныхЗначениеДанныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.НастройкаВыбораЗначенийПеременных.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗапретитьСоздание", Истина);
		
		масЗначения = ЭтотОбъект.ЗначенияДанныхИзВидаАукциона.Получить(ТекДанные.ИсточникДанных);
		
		Если масЗначения <> Неопределено Тогда
			ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", масЗначения));	
		Иначе
			ПараметрыФормы.Вставить("Отбор", Новый Структура("ЭтоЭлементПредопределенныхДанных", Истина));	
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ВыборНастройкиРасчетовИтогов_Продолжить", ЭтотОбъект, ТекДанные);
		
		ОткрытьФорму("ПланВидовХарактеристик.АукЭлементыДанныхАукционов.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, Оповещение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыбораЗначенийПеременныхИсточникДанныхПриИзменении(Элемент)
	ТекДанные = Элементы.НастройкаВыбораЗначенийПеременных.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЗначениеДанных = Неопределено;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПриИзменении(Элемент)
	Объект.Формула = АукОбщийКлиент.ОтформатироватьФормулуРасчета(Объект.Формула);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСписанияПараметровСписыватьПоПеременнойОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекДанные = Элементы.НастройкаСписанияПараметров.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		Если Объект.НастройкаСписанияПараметров.НайтиСтроки(Новый Структура("Параметр, СписыватьПоПеременной", ТекДанные.Параметр, ВыбранноеЗначение)).Количество() <> 0 Тогда
			СтандартнаяОбработка = Ложь;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Для параметра <%1> уже указана такая переменная'"), ТекДанные.Параметр));
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьСписокПеременных(Команда)
	ЗаполнитьСписокПеременныхПоСтрокеФормулы();	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьВПеременную(Команда)
	Элементы.Формула.ВыделенныйТекст = АукОбщийКлиент.ПреобразоватьСтрокуИмениПеременнойПоФормату(Элементы.Формула.ВыделенныйТекст);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьШаблонРезультатаИзДанныхФормы()
	Объект.ШаблонРезультата = ЭтотОбъект.ШаблонРезультатаТекстДо + АукОбщийКлиентСервер.ОперандПредставленияПромежуточногоИтога() + ЭтотОбъект.ШаблонРезультатаТекстПосле;	
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьИнтерфейс()
	масЗначения = ЭтотОбъект.ЗначенияДанныхИзВидаАукциона.Получить(ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.ПараметрАукциона"));
	
	Если масЗначения <> Неопределено Тогда
		АукОбщийКлиент.УстановитьПараметрыОтбораДляЭлементаФормы("Отбор.Ссылка", масЗначения, Элементы.НастройкаСписанияПараметровПараметр);
	КонецЕсли;														  
	
	// Обновить пример шаблона результат
	ОбновитьПримерШаблонаРезультата();
	
	Элементы.ГруппаШаблонРезультата.Видимость = ЭтотОбъект.ЭтоНастройкаРасчетовПромежуточногоИтога;	
	
	Элементы.НастройкаСписанияПараметров.Видимость = Не ЭтотОбъект.ЭтоНастройкаРасчетовПромежуточногоИтога;
	
	// Блокировать изменения
	//Если ЭтотОбъект.БлокироватьИзмененияДанных Тогда
	//	АукОбщийКлиент.УставновитьРежимТолькоПросмотрУВсехЭлементов(ЭтотОбъект);
	//Иначе
	//	Элементы.НадписьЗапретРедактирования.Видимость = Ложь;
	//КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьПримерШаблонаРезультата()
	масФормСтрока = Новый Массив;
	масФормСтрока.Добавить(Новый ФорматированнаяСтрока("Пример: ", Новый Шрифт(Истина, ,)));
	масФормСтрока.Добавить(Новый ФорматированнаяСтрока(ЭтотОбъект.ШаблонРезультатаТекстДо + "10" + ЭтотОбъект.ШаблонРезультатаТекстПосле, Новый Шрифт(,, Истина)));
		
	Элементы.ШаблонРезультатаПример.Заголовок = Новый ФорматированнаяСтрока(масФормСтрока);	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтобрыНаПолеВыбора(пЭлемент)
	ТекДанные = пЭлемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		масЗначения = ЭтотОбъект.ЗначенияДанныхИзВидаАукциона.Получить(ТекДанные.ИсточникДанных);
		
		Если масЗначения <> Неопределено Тогда
			АукОбщийКлиент.УстановитьПараметрыОтбораДляЭлементаФормы("Отбор.Ссылка", масЗначения, Элементы.НастройкаВыбораЗначенийПеременныхЗначениеДанных);	
		Иначе
			АукОбщийКлиент.УстановитьПараметрыОтбораДляЭлементаФормы("Отбор.ЭтоЭлементПредопределенныхДанных",
																	  Истина,
																	  Элементы.НастройкаВыбораЗначенийПеременныхЗначениеДанных);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеКастомное(пОтказ)
	булРезультат = Истина;
	
	Если ЭтотОбъект.ЭтоНастройкаРасчетовПромежуточногоИтога Тогда
		Если Не ЗначениеЗаполнено(Объект.ШаблонРезультата) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено представление результата'"),,, "Объект.ШаблонРезультата", пОтказ);
			
			булРезультат = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат булРезультат;
КонецФункции	

&НаСервере
Процедура НачальнаяИнициализация()
	Если Параметры.ДополнительныеПараметры.Свойство("ЭтоНастройкаРасчетовПромежуточногоИтога") Тогда
		ЭтотОбъект.ЭтоНастройкаРасчетовПромежуточногоИтога = Параметры.ДополнительныеПараметры.ЭтоНастройкаРасчетовПромежуточногоИтога;	
	КонецЕсли;	
	
	ЭтотОбъект.ЗначенияДанныхИзВидаАукциона = Новый ФиксированноеСоответствие(Справочники.АукВидыАукционов.ОписаниеДанныхСвязанныхСАукциономПоВидуТолькоЗначения(Объект.Владелец));
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВидРезультата = АукОбщийКлиентСервер.ВидРезультатРасчетаИтогаПоУмолчанию();
	Иначе
		сткРез = АукОбщийВызовСервера.ТекстДоИПослеВШаблонеРезультатаРасчета(Объект.ШаблонРезультата);
		
		ЭтотОбъект.ШаблонРезультатаТекстДо		= сткРез.ТекстДо;
		ЭтотОбъект.ШаблонРезультатаТекстПосле	= сткРез.ТекстПосле;
		
		// Инициализировать флаг "БлокироватьИзмененияДанных"
		ЭтотОбъект.БлокироватьИзмененияДанных = Справочники.АукАукционы.ЕстьАукционыСВидом(Объект.Владелец);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСписокПеременныхПоСтрокеФормулы()
	АукОбщийКлиент.ЗаполнитьТабличнуюЧастьПеременнымиПоФормуле(Объект.Формула, Объект.Переменные, Объект.НастройкаВыбораЗначенийПеременных, Объект.НастройкаСписанияПараметров);
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборЗначенийПеременной(Знач НомерСтроки)
	//Если Не ЗначениеЗаполнено(пПеременная) Тогда
	//	пПеременная = "[]";	
	//КонецЕсли;
	
	Элементы.НастройкаВыбораЗначенийПеременных.ОтборСтрок = Новый ФиксированнаяСтруктура("ПеременнаяНомерСтроки", НомерСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеПеременнойПоПеременной()

	ПеременныеТекДанные = Элементы.Переменные.ТекущиеДанные;
	
	Если ПеременныеТекДанные = Неопределено Или Не ЗначениеЗаполнено(ПеременныеТекДанные.Переменная) Тогда 

		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите имя переменной'"));
		
	Иначе	
		НовСтрока = Объект.НастройкаВыбораЗначенийПеременных.Добавить();
		
		НовСтрока.Переменная			= ПеременныеТекДанные.Переменная;
		НовСтрока.ПеременнаяНомерСтроки	= ПеременныеТекДанные.НомерСтроки;
		
		УстановитьОтборЗначенийПеременной(ПеременныеТекДанные.НомерСтроки);										   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНастройкиРасчетовИтогов_Продолжить(Результат, пТекДанные) Экспорт
	Если Результат <> Неопределено Тогда	
		ВыборНастройкиРасчетовИтогов_ОбработкаВыбора(Результат, пТекДанные);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНастройкиРасчетовИтогов_ОбработкаВыбора(Результат, пТекДанные)
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("Переменная",		пТекДанные.Переменная);
	//сткОтбор.Вставить("ПеременнаяНомерСтроки",		пТекДанные.ПеременнаяНомерСтроки);
	сткОтбор.Вставить("ИсточникДанных", пТекДанные.ИсточникДанных);
	сткОтбор.Вставить("ЗначениеДанных", Результат);
	
	Если пТекДанные.ЗначениеДанных <> Результат Тогда
		
		Если Объект.НастройкаВыбораЗначенийПеременных.НайтиСтроки(сткОтбор).Количество() = 0 Тогда	
			пТекДанные.ЗначениеДанных = Результат;
			
			Модифицированность = Истина;
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Такое значение уже есть в списке!'"));	
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
